In [ ]:
import pandas as pd 
import numpy as np 
from sklearn.metrics import mean_squared_error

In [2]:
dataset= pd.read_csv('persons1.csv')
dataset

             Name  q1  q2  q3  q4  q5  q6  q7  q8  q9  q10
0        Anushka    1   3   4   2   2   3   1   1   2    3
1             Ram   1   3   4   2   1   1   4   2   3    4
2            raju   2   3   1   1   2   3   1   3   1    3
3           bheem   3   3   2   1   2   4   2   2   1    4
4           choti   3   3   2   2   1   3   4   1   4    3
...           ...  ..  ..  ..  ..  ..  ..  ..  ..  ..  ...
4104  0.562400292   4   2   2   2   1   1   3   2   3    1
4105  0.991258896   1   4   1   4   4   2   3   4   1    2
4106  0.689592464   1   1   4   1   1   4   2   4   4    3
4107   0.02183965   1   4   4   3   4   2   1   2   4    4
4108   0.56127283   1   1   1   4   2   4   4   3   3    1

[4109 rows x 11 columns]

In [3]:
personID= ["Love_"+str(x) for x in range(1,4110)]

In [4]:
dataset.describe()

,q1,q2,q3,q4,q5,q6,q7,q8,q9,q10
count,4109.000000,4109.000000,4109.000000,4109.000000,4109.000000,4109.000000,4109.000000,4109.000000,4109.000000,4109.000000
mean,2.481139,2.487223,2.505232,2.504259,2.486493,2.479679,2.490144,2.470674,2.446824,2.498905
std,1.115286,1.124285,1.114778,1.109310,1.129245,1.130221,1.119323,1.130238,1.117231,1.112167
min,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000
25%,1.000000,1.000000,2.000000,2.000000,1.000000,1.000000,1.000000,1.000000,1.000000,2.000000
50%,2.000000,2.000000,3.000000,3.000000,2.000000,2.000000,2.000000,2.000000,2.000000,3.000000
75%,3.000000,3.000000,4.000000,3.000000,4.000000,4.000000,3.000000,3.000000,3.000000,3.000000
max,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000

In [5]:
dataset.insert(0,"LoveID", personID)
dataset

         LoveID         Name  q1  q2  q3  q4  q5  q6  q7  q8  q9  q10
0        Love_1     Anushka    1   3   4   2   2   3   1   1   2    3
1        Love_2          Ram   1   3   4   2   1   1   4   2   3    4
2        Love_3         raju   2   3   1   1   2   3   1   3   1    3
3        Love_4        bheem   3   3   2   1   2   4   2   2   1    4
4        Love_5        choti   3   3   2   2   1   3   4   1   4    3
...         ...          ...  ..  ..  ..  ..  ..  ..  ..  ..  ..  ...
4104  Love_4105  0.562400292   4   2   2   2   1   1   3   2   3    1
4105  Love_4106  0.991258896   1   4   1   4   4   2   3   4   1    2
4106  Love_4107  0.689592464   1   1   4   1   1   4   2   4   4    3
4107  Love_4108   0.02183965   1   4   4   3   4   2   1   2   4    4
4108  Love_4109   0.56127283   1   1   1   4   2   4   4   3   3    1

[4109 rows x 12 columns]

In [6]:
finalPairs=[]

marked=set()

for i in range(len(dataset)):
    if(dataset.iloc[i,0] not in marked):
        marked.add(dataset.iloc[i,0])
        mseScore= 10

        for j in range(i+1, len(dataset)):
            if(dataset.iloc[j,0] not in marked):
                mseScore=min(mseScore, mean_squared_error(dataset.iloc[i,2:], dataset.iloc[j, 2:]))

                if(mseScore <= 1.2):
                    pair= (dataset.iloc[i,0], dataset.iloc[j,0], mseScore)
                    finalPairs.append(pair)
                    marked.add(dataset.iloc[j,0])
                    break

In [7]:
# making a dataset for the pairs

couplesRecord={"PersonId 1":[], "PersonId 2":[], "VaryScore":[]}
couplesDataset= pd.DataFrame(couplesRecord)

In [8]:
person1= []
person2=[]
mseList=[]

for i in finalPairs:
    person1.append(i[0])
    person2.append(i[1])
    mseList.append(i[2])

couplesDataset['PersonId 1']=person1
couplesDataset['PersonId 2']=person2
couplesDataset['VaryScore']= mseList

In [12]:
couplesDataset
df = pd.DataFrame(couplesDataset)

In [13]:
# command to export the file in excel
df.to_excel('output.xlsx', index=False)